package team.jnu.wardsystem.ui;

public class DoctorUI {
    //左边一排菜单栏
    //右边主界面
    //左边可以选择的功能有：查看个人信息，查看所属病人信息以及对应的病床信息，查看所有设备信息
    //查看个人信息，右边页面更新为医生的用户名，密码（星号），姓名，性别，职位，手机号，所属科室，其中手机号和密码右边有按钮，点击后可以修改信息
    /*
    查看病人所属信息，右边页面变成一个表格，里面是所属的全部病人的姓名，性别，年龄，病床号和对应病房
    右键单击表格中的病人的信息可以选择查看详情，详情里面有所有信息和备注
    右键单击表格中的病人床位一栏可以更改，可以弹出一个界面，界面里面有其他对应科室对应性别的空床和对应的病房号信息，可以双击选择（或者其他选择方式），更改完自动更新病房
    */
    /*
    查看所有设备信息，右边页面变成一个表格，里面是所有设备的信息，包括设备编号，设备类型，设备被哪个病床所用
    右键单击表格选中设备可以分配设备，会弹出一个选择框，里面有管理的所有病人的姓名和id，选择病人来使用
     */
}